IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0g1x0x_g3x0x/I2C0_1.0.xml
        <register id="I2C0_INT_EVENT0_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="MRXDONE" description="Master Receive Data Interrupt
Signals that a byte has been received" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="TIMEOUTA" description="Timeout A interrupt" begin="14" end="14" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="MNACK" description="Address/Data NACK Interrupt" begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="MSTART" description="START Detection Interrupt" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="MSTOP" description="STOP Detection Interrupt" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="MARBLOST" description="Arbitration Lost Interrupt" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="MTXDONE" description="Master Transmit Transaction completed Interrupt" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="MRXFIFOFULL" description="RXFIFO full event." begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="MTXEMPTY" description="Transmit FIFO Empty interrupt mask. This interrupt is set if all data in the Transmit FIFO have been shifted out and the transmit goes into idle mode." begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="MRXFIFOTRG" description="Master Receive FIFO Trigger
Trigger when RX FIFO contains &gt;= defined bytes" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="MTXFIFOTRG" description="Master Transmit FIFO Trigger
Trigger when Transmit FIFO contains &lt;= defined bytes" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="MDMA_DONE1_2" description="DMA Done 1 on Event Channel 2" begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Interrupt disabled"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="MDMA_DONE1_3" description="DMA Done 1 on Event Channel 3" begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Interrupt disabled"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="SRXDONE" description="Slave Receive Data Interrupt
Signals that a byte has been received" begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="STXDONE" description="Slave Transmit Transaction completed Interrupt" begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="SGENCALL" description="General Call Interrupt" begin="24" end="24" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="STXEMPTY" description="Transmit FIFO Empty interrupt mask. This interrupt is set if all data in the Transmit FIFO have been shifted out and the transmit goes into idle mode." begin="21" end="21" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="SRXFIFOFULL" description="RXFIFO full event. This interrupt is set if an RX FIFO is full." begin="20" end="20" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="SRXFIFOTRG" description="Slave Receive FIFO Trigger" begin="18" end="18" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="STXFIFOTRG" description="Slave Transmit FIFO Trigger" begin="19" end="19" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="SSTART" description="Start Condition Interrupt" begin="22" end="22" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set interrupt"/>
            </bitfield>
            <bitfield id="SSTOP" description="Stop Condition Interrupt" begin="23" end="23" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set interrupt"/>
            </bitfield>
            <bitfield id="SDMA_DONE1_2" description="DMA Done 1 on Event Channel 2" begin="25" end="25" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set interrupt"/>
            </bitfield>
            <bitfield id="SDMA_DONE1_3" description="DMA Done 1 on Event Channel 3" begin="26" end="26" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set interrupt"/>
            </bitfield>
            <bitfield id="MPEC_RX_ERR" description="Master RX Pec Error Interrupt" begin="13" end="13" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set interrupt"/>
            </bitfield>
            <bitfield id="TIMEOUTB" description="Timeout B Interrupt" begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set interrupt"/>
            </bitfield>
            <bitfield id="SPEC_RX_ERR" description="Slave RX Pec Error Interrupt" begin="27" end="27" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set interrupt"/>
            </bitfield>
            <bitfield id="STX_UNFL" description="Slave TX FIFO underflow" begin="28" end="28" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set interrupt"/>
            </bitfield>
            <bitfield id="SRX_OVFL" description="Slave RX FIFO overflow" begin="29" end="29" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set interrupt"/>
            </bitfield>
            <bitfield id="SARBLOST" description="Slave Arbitration Lost" begin="30" end="30" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set interrupt"/>
            </bitfield>
            <bitfield id="INTR_OVFL" description="Interrupt overflow" begin="31" end="31" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="SET" value="0x1" description="Set interrupt"/>
            </bitfield>
        </register>
        <register id="I2C0_INT_EVENT0_ICLR" width="32" offset="0x28" description="Interrupt clear">
            <bitfield id="MRXDONE" description="Master Receive Data Interrupt
Signals that a byte has been received" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="TIMEOUTA" description="Timeout A interrupt" begin="14" end="14" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="MNACK" description="Address/Data NACK Interrupt" begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="MSTART" description="START Detection Interrupt" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="MSTOP" description="STOP Detection Interrupt" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="MARBLOST" description="Arbitration Lost Interrupt" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="MTXDONE" description="Master Transmit Transaction completed Interrupt" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="MRXFIFOFULL" description="RXFIFO full event." begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="MTXEMPTY" description="Transmit FIFO Empty interrupt mask. This interrupt is set if all data in the Transmit FIFO have been shifted out and the transmit goes into idle mode." begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="MRXFIFOTRG" description="Master Receive FIFO Trigger
Trigger when RX FIFO contains &gt;= defined bytes" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="CLR" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="MTXFIFOTRG" description="Master Transmit FIFO Trigger
Trigger when Transmit FIFO contains &lt;= defined bytes" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="CLR" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="MDMA_DONE1_2" description="DMA Done 1 on Event Channel 2" begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Interrupt disabled"/>
                <bitenum id="CLR" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="MDMA_DONE1_3" description="DMA Done 1 on Event Channel 3" begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Interrupt disabled"/>
                <bitenum id="CLR" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="SRXDONE" description="Slave Receive Data Interrupt
Signals that a byte has been received" begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="STXDONE" description="Slave Transmit Transaction completed Interrupt" begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="SGENCALL" description="General Call Interrupt" begin="24" end="24" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="STXEMPTY" description="Transmit FIFO Empty interrupt mask. This interrupt is set if all data in the Transmit FIFO have been shifted out and the transmit goes into idle mode." begin="21" end="21" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="SRXFIFOFULL" description="RXFIFO full event. This interrupt is set if an RX FIFO is full." begin="20" end="20" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="CLR" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="SRXFIFOTRG" description="Slave Receive FIFO Trigger" begin="18" end="18" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="CLR" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="STXFIFOTRG" description="Slave Transmit FIFO Trigger" begin="19" end="19" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="CLR" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="SSTART" description="Slave START Detection Interrupt" begin="22" end="22" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear interrupt"/>
            </bitfield>
            <bitfield id="SSTOP" description="Slave STOP Detection Interrupt" begin="23" end="23" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear interrupt"/>
            </bitfield>
            <bitfield id="SDMA_DONE1_2" description="DMA Done 1 on Event Channel 2" begin="25" end="25" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear interrupt"/>
            </bitfield>
            <bitfield id="SDMA_DONE1_3" description="DMA Done 1 on Event Channel 3" begin="26" end="26" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear interrupt"/>
            </bitfield>
            <bitfield id="MPEC_RX_ERR" description="Master RX Pec Error Interrupt" begin="13" end="13" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
            </bitfield>
            <bitfield id="TIMEOUTB" description="Timeout B Interrupt" begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
            </bitfield>
            <bitfield id="SPEC_RX_ERR" description="Slave RX Pec Error Interrupt" begin="27" end="27" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
            </bitfield>
            <bitfield id="STX_UNFL" description="Slave TX FIFO underflow" begin="28" end="28" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
            </bitfield>
            <bitfield id="SRX_OVFL" description="Slave RX FIFO overflow" begin="29" end="29" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
            </bitfield>
            <bitfield id="SARBLOST" description="Slave Arbitration Lost" begin="30" end="30" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
            </bitfield>
            <bitfield id="INTR_OVFL" description="Interrupt overflow" begin="31" end="31" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clear interrupt"/>
            </bitfield>
        </register>
