IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0g1x0x_g3x0x/I2C0_1.0.xml
        <register id="I2C0_MTXDATA" width="32" offset="0x10" description="I2C Master TXData">
            <bitfield id="VALUE" description="Transmit Data
This byte contains the data to be transferred during the next transaction." begin="7" end="0" width="8" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
            </bitfield>
        </register>
        <register id="I2C0_MTPR" width="32" offset="0x14" description="I2C Master Timer Period">
            <bitfield id="TPR" description="Timer Period 
This field is used in the equation to configure SCL_PERIOD :
SCL_PERIOD = (1 + TPR ) * (SCL_LP + SCL_HP ) * INT_CLK_PRD
where: 
  SCL_PRD is the SCL line period (I2C clock).
  TPR is the Timer Period register value (range of 1 to 127).
  SCL_LP is the SCL Low period (fixed at 6).
  SCL_HP is the SCL High period (fixed at 4).
  CLK_PRD is the functional clock period in ns." begin="6" end="0" width="7" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="MAXIMUM" value="0x7F" description="Highest possible value"/>
            </bitfield>
        </register>
        <register id="I2C0_MCR" width="32" offset="0x18" description="I2C Master Configuration">
            <bitfield id="LPBK" description="I2C Loopback" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Normal operation."/>
                <bitenum id="ENABLE" value="0x1" description="The controller in a test mode loopback configuration."/>
            </bitfield>
            <bitfield id="MMST" description="Multimaster mode. In Multimaster mode the SCL high time counts once the SCL line has been detected high. If this is not enabled the high time counts as soon as the SCL line has been set high by the I2C controller." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable Multimaster mode."/>
                <bitenum id="ENABLE" value="0x1" description="Enable Multimaster mode."/>
            </bitfield>
            <bitfield id="ACTIVE" description="Device Active  After this bit has been set, it should not be set again unless it has been cleared by writing a 0 or by a reset, otherwise transfer failures may occur." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disables the I2C master operation."/>
                <bitenum id="ENABLE" value="0x1" description="Enables the I2C master operation."/>
            </bitfield>
            <bitfield id="CLKSTRETCH" description="Clock Stretching. This bit controls the support for clock stretching of the I2C bus." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disables the clock stretching detection. This can be disabled if no slave on the bus does support clock streching, so that the maximum speed on the bus can be reached."/>
                <bitenum id="ENABLE" value="0x1" description="Enables the clock stretching detection. Enabling the clock strechting ensures compliance to the I2C standard but could limit the speed due the clock stretching."/>
            </bitfield>
        </register>
        <register id="I2C0_MBMON" width="32" offset="0x24" description="I2C Master Bus Monitor">
            <bitfield id="SCL" description="I2C SCL Status" begin="0" end="0" width="1" rwaccess="R">
                <bitenum id="CLEARED" value="0x0" description="The I2CSCL signal is low."/>
                <bitenum id="SET" value="0x1" description="The I2CSCL signal is high. Note: During and right after reset, the SCL pin is in GPIO input mode without the internal pull enabled. For proper I2C operation, the user should have the external pull-up resistor in place before starting any I2C operations."/>
            </bitfield>
            <bitfield id="SDA" description="I2C SDA Status" begin="1" end="1" width="1" rwaccess="R">
                <bitenum id="CLEARED" value="0x0" description="The I2CSDA signal is low."/>
                <bitenum id="SET" value="0x1" description="The I2CSDA signal is high. Note: During and right after reset, the SDA pin is in GPIO input mode without the internal pull enabled. For proper I2C operation, the user should have the external pull-up resistor in place before starting any I2C operations."/>
            </bitfield>
        </register>
        <register id="I2C0_MFIFOCTL" width="32" offset="0x28" description="I2C Master FIFO Control">
            <bitfield id="TXTRIG" description="TX FIFO Trigger
Indicates at what fill level in the TX FIFO a trigger will be generated." begin="2" end="0" width="3" rwaccess="R/W">
                <bitenum id="LEVEL_4" value="0x4" description="Trigger when TX FIFO contains  4 byte"/>
                <bitenum id="LEVEL_5" value="0x5" description="Trigger when TX FIFO contains  5 byte"/>
                <bitenum id="LEVEL_6" value="0x6" description="Trigger when TX FIFO contains  6 byte"/>
                <bitenum id="LEVEL_7" value="0x7" description="Trigger when TX FIFO contains  7 byte"/>
            </bitfield>
            <bitfield id="TXFLUSH" description="TX FIFO Flush
Setting this bit will Flush the TX FIFO. 
Before reseting this bit to stop Flush the TXFIFOCNT should be checked to be 8 and indicating that the Flush has completed." begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="NOFLUSH" value="0x0" description="Do not Flush FIFO"/>
                <bitenum id="FLUSH" value="0x1" description="Flush FIFO"/>
            </bitfield>
            <bitfield id="RXTRIG" description="RX FIFO Trigger
Indicates at what fill level in the RX FIFO a trigger will be generated.
Note: Programming RXTRIG to 0x0 has no effect since no data is
present to transfer out of RX FIFO." begin="10" end="8" width="3" rwaccess="R/W">
                <bitenum id="LEVEL_5" value="0x4" description="Trigger when RX FIFO contains &gt;= 5 byte"/>
                <bitenum id="LEVEL_6" value="0x5" description="Trigger when RX FIFO contains &gt;= 6 byte"/>
                <bitenum id="LEVEL_7" value="0x6" description="Trigger when RX FIFO contains &gt;= 7 byte"/>
                <bitenum id="LEVEL_8" value="0x7" description="Trigger when RX FIFO contains &gt;= 8 byte"/>
            </bitfield>
            <bitfield id="RXFLUSH" description="RX FIFO Flush
Setting this bit will Flush the RX FIFO.
Before reseting this bit to stop Flush the RXFIFOCNT should be checked to be 0 and indicating that the Flush has completed." begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="NOFLUSH" value="0x0" description="Do not Flush FIFO"/>
                <bitenum id="FLUSH" value="0x1" description="Flush FIFO"/>
            </bitfield>
        </register>
        <register id="I2C0_MFIFOSR" width="32" offset="0x2C" description="I2C Master FIFO Status Register">
            <bitfield id="RXFIFOCNT" description="Number of Bytes which could be read from the RX FIFO" begin="3" end="0" width="4" rwaccess="R">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="MAXIMUM" value="0x8" description="Highest possible value"/>
            </bitfield>
            <bitfield id="TXFIFOCNT" description="Number of Bytes which could be put into the TX FIFO" begin="11" end="8" width="4" rwaccess="R">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="MAXIMUM" value="0x8" description="Highest possible value"/>
            </bitfield>
            <bitfield id="RXFLUSH" description="RX FIFO Flush
When this bit is set a Flush operation for the RX FIFO is active. Clear the RXFLUSH bit in the control register to stop." begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="INACTIVE" value="0x0" description="FIFO Flush not active"/>
                <bitenum id="ACTIVE" value="0x1" description="FIFO Flush active"/>
            </bitfield>
            <bitfield id="TXFLUSH" description="TX FIFO Flush
When this bit is set a Flush operation for the TX FIFO is active. Clear the TXFLUSH bit in the control register to stop." begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="INACTIVE" value="0x0" description="FIFO Flush not active"/>
                <bitenum id="ACTIVE" value="0x1" description="FIFO Flush active"/>
            </bitfield>
        </register>
        <register id="I2C0_MASTER_I2CPECCTL" width="32" offset="0x30" description="I2C master PEC control register">
            <bitfield id="PECCNT" description="PEC Count
When this field is non zero, the number of I2C bytes are counted (Note that although the PEC is calculated on the I2C address it is not counted at a byte). When the byte count = PECCNT and the state machine is transmitting, the contents of the LSFR is loaded into the shift register instead of the byte received from the Tx FIFO. When the state machine is receiving, after the last bit of this byte is received the LSFR is checked and if it is non-zero, a PEC RX Error interrupt is generated. The I2C packet must be padded to include the PEC byte for both transmit and receive. In transmit mode the FIFO must be loaded with a dummy PEC byte. In receive mode the PEC byte will be passed to the Rx FIFO.

In the normal Master use case, FW would set PECEN=1 and PECCNT=SMB packet length (Not including Slave Address byte, but including the PEC byte). FW would then configure DMA to allow the packet to complete unassisted and write MCTR to initiate the transaction.

Note that when the byte count = PEC CNT, the byte count is reset to 0 and multiple PEC calculation can automatically occur within a single I2C transaction.

Note that any write to the MASTER_I2CPECCTL Register will clear the current PEC Byte Count in the Master State Machine." begin="8" end="0" width="9" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum Value"/>
                <bitenum id="MAXIMUM" value="0x1FF" description="Maximum Value"/>
            </bitfield>
            <bitfield id="PECEN" description="PEC Enable
This bit enables the SMB Packet Error Checking (PEC). When enabled the PEC is calculated on all bits accept the Start, Stop, Ack and Nack. The PEC LSFR and the Byte Counter is set to 0 when the State Machine is in the IDLE state, which occur following a Stop or when a timeout occurs. The Counter is also set to 0 after the PEC byte is sent or received. Note that the NACK is automatically send following a PEC byte that results in a PEC error.
The PEC Polynomial is x^8 + x^2 + x^1 + 1." begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="PEC is disabled in master mode"/>
                <bitenum id="ENABLE" value="0x1" description="PEC is enabled in master mode"/>
            </bitfield>
        </register>
